Revit 2026 API

# RoofTypeThermalProperties Property

---

The calculated and settable thermal properties of the RoofType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ThermalProperties ThermalProperties { get; }
```
```vb
Public ReadOnly Property ThermalProperties As ThermalProperties
	Get
```
```cpp
public:
property ThermalProperties^ ThermalProperties {
	ThermalProperties^ get ();
}
```
```fsharp
member ThermalProperties : ThermalProperties with get
```

#### Property Value

ThermalProperties

Returns  if the roof has no thermal properties. Curtain roofs do not store thermal properties.

#### Reference

RoofType Class

Autodesk.Revit.DB Namespace